app/Controllers/colaboracionController.php

    public function tareaColaborar(){


        $modeloTarea = new Tarea();
        $modeloSubTarea = new Subtarea();
        $modeloMiembroSubtarea = new MiembroSubtarea();
        $modeloColaboracion = new Colaboracion();

        if (isset($this->request) && $this->request->getPost('tarea_id') !== null) {
    $idTarea = $this->request->getPost('tarea_id');
    } else {
        $idTarea = session()->getFlashdata('tarea_id');
    }
    $modeloTarea->actualizarEstadoPorSubtareas($idTarea);
        $subTareas = $modeloSubTarea->obtenerSubTareas($idTarea);
        $data['idTarea'] = $idTarea;
        $data['tarea'] = $modeloTarea->obtenerTarea($idTarea);
        $data['subTareas'] = $subTareas;
        $data['subtareas'] = [];

        foreach ($subTareas as $subtarea) {
            $responsables = $modeloMiembroSubtarea
        ->select('usuario.*')
        ->join('usuario', 'usuario.id = miembro_subtarea.usuario_id')
        ->where('miembro_subtarea.subtarea_id', $subtarea['id'])
        ->findAll();

    $subtarea['responsables'] = $responsables;
    $data['subtareas'][] = $subtarea;
}
$colaboradores = $modeloColaboracion
            ->select('usuario.*')
            ->join('usuario', 'usuario.id = colaboracion.usuario_id')
            ->where('colaboracion.tarea_id', $idTarea)
            ->findAll();
---
SELECT `usuario`.*
FROM `miembro_subtarea`
JOIN `usuario` ON `usuario`.`id` = `miembro_subtarea`.`usuario_id`
WHERE `miembro_subtarea`.`subtarea_id` = '5'
SELECT `usuario_id`, `usuario_id`
FROM `miembro_subtarea`
JOIN `subtarea` ON `subtarea`.`id` = `miembro_subtarea`.`subtarea_id`
WHERE `subtarea`.`tarea_id` = '3'
SELECT `usuario`.*
FROM `colaboracion`
JOIN `usuario` ON `usuario`.`id` = `colaboracion`.`usuario_id`
WHERE `colaboracion`.`tarea_id` = '3'