app/Controllers/tareaController.php

SELECT `usuario`.*
FROM `miembro_subtarea`
JOIN `usuario` ON `usuario`.`id` = `miembro_subtarea`.`usuario_id`
WHERE `miembro_subtarea`.`subtarea_id` = '27'
SELECT `usuario`.*
FROM `miembro_subtarea`
JOIN `usuario` ON `usuario`.`id` = `miembro_subtarea`.`usuario_id`
WHERE `miembro_subtarea`.`subtarea_id` = '21'
SELECT `usuario`.*
FROM `colaboracion`
JOIN `usuario` ON `usuario`.`id` = `colaboracion`.`usuario_id`
WHERE `colaboracion`.`tarea_id` = '10'
SELECT `usuario_id`, `usuario_id`
FROM `miembro_subtarea`
JOIN `subtarea` ON `subtarea`.`id` = `miembro_subtarea`.`subtarea_id`
WHERE `subtarea`.`tarea_id` = '10'
---
    public function mostrarDetalles($idTarea = null){
    if ($idTarea === null) {
        $idTarea = $this->request->getPost('tarea_id');
        session()->setFlashdata('tarea_id', $idTarea);
    }

        $modeloTarea = new Tarea();
        $modeloSubTarea = new Subtarea();
        $modeloMiembroSubtarea = new MiembroSubtarea();
        $modeloColaboracion = new Colaboracion();

        $modeloTarea->actualizarEstadoPorSubtareas($idTarea);
        $subTareas = $modeloSubTarea->obtenerSubTareas($idTarea);
        $data['tarea'] = $modeloTarea->obtenerTarea($idTarea);
        $data['subTareas'] = $subTareas;
        $data['subtareas'] = [];
        foreach ($subTareas as $subtarea) {
            $responsables = $modeloMiembroSubtarea
        ->select('usuario.*')
        ->join('usuario', 'usuario.id = miembro_subtarea.usuario_id')
        ->where('miembro_subtarea.subtarea_id', $subtarea['id'])
        ->findAll();
    $subtarea['responsables'] = $responsables;
    $data['subtareas'][] = $subtarea;
}
$colaboradores = $modeloColaboracion
            ->select('usuario.*')
            ->join('usuario', 'usuario.id = colaboracion.usuario_id')
            ->where('colaboracion.tarea_id', $idTarea)
            ->findAll();
        $asignados = $modeloMiembroSubtarea
            ->select('usuario_id')
            ->join('subtarea', 'subtarea.id = miembro_subtarea.subtarea_id')
            ->where('subtarea.tarea_id', $idTarea)
            ->findColumn('usuario_id');

SELECT *
FROM `tarea`
WHERE `tarea`.`id` = '8'
---
    public function editar()
    {
        $id = $this->request->getPost('id_tarea');
        $modeloTarea = new Tarea();
        $data['tarea'] = $modeloTarea->find($id);