app/Controllers/usuarioController.php

    public function guardarRegistro()
    {
        helper(['form']);

        $data = [
            'nombre'     => $this->request->getPost('nombre'),
            'correo'     => $this->request->getPost('correo'),
            'contrasenia' => hash('sha256', $this->request->getPost('clave'))
        ];

        $model = new Usuario();
        $model->insert($data);
---
INSERT INTO `usuario` (`nombre`, `correo`, `contrasenia`) VALUES ('Pedro', 'pedroriveros.lab@gmail.com', '5994471abb01112afcc18159f6cc74b4f511b99806da59b3caf5a9c173cacfc5')