app/Models/subTarea.php

    public function obtenerSubTareas($id_Tarea)
{
    return $this->where('tarea_id', $id_Tarea)->findAll();
---
SELECT *
FROM `subtarea`
WHERE `tarea_id` = '9'