app/Models/tarea.php

SELECT *
FROM `tarea`
WHERE `tarea`.`id` = '9'
---
    public function obtenerTarea($id)
    {
        return $this->find($id);

SELECT `tarea`.*
FROM `tarea`
JOIN `colaboracion` ON `colaboracion`.`tarea_id` = `tarea`.`id`
WHERE `colaboracion`.`usuario_id` = '10'
AND `tarea`.`archivada` = 0
---
    public function obtenerTareasColaborativas($usuarioId)
        {
            return $this->db->table('tarea')
                ->select('tarea.*')
                ->join('colaboracion', 'colaboracion.tarea_id = tarea.id')
                ->where('colaboracion.usuario_id', $usuarioId)
                ->where('tarea.archivada', 0)
                ->get()
                ->getResultArray();

SELECT *
FROM `tarea`
WHERE `usuario_id` = '7'
AND `archivada` = 1
---
    public function obtenerTareasArchivadas($usuarioId)
    {
        return $this->where('usuario_id', $usuarioId)
                    ->where('archivada', 1)
                    ->findAll();

SELECT *
FROM `tarea`
WHERE `usuario_id` = '10'
AND `archivada` = 0
---
    public function obtenerTareasNoArchivadas($usuarioId)
    {
        return $this->where('usuario_id', $usuarioId)
                    ->where('archivada', 0)
                    ->findAll();

UPDATE `tarea` SET `estado` = 'en_proceso'
WHERE `tarea`.`id` IN ('9')
---
    public function cambiarEstado($id, $nuevoEstado)
    {
        return $this->update($id, ['estado' => $nuevoEstado]);

SELECT *
FROM `subtarea`
WHERE `tarea_id` = '9'
UPDATE `tarea` SET `estado` = 'definida'
WHERE `tarea`.`id` IN ('9')
---
public function actualizarEstadoPorSubtareas($idTarea) {
    $modeloSubtarea = new Subtarea();

    $subtareas = $modeloSubtarea->where('tarea_id', $idTarea)->findAll();

    if (empty($subtareas)) return;

    $completadas = 0;
    $total = count($subtareas);

    foreach ($subtareas as $sub) {
        if ($sub['estado'] === 'completada') {
            $completadas++;
        }
    }

    if ($completadas === $total) {
        $nuevoEstado = 'completada';
    } elseif ($completadas > 0) {
        $nuevoEstado = 'en_proceso';
    } else {
        $nuevoEstado = 'definida';
    }

    $this->update($idTarea, ['estado' => $nuevoEstado]);